#+TITLE: Plan for Vlabs Landing Pages
#+AUTHOR: VLEAD
#+DATE: [2017-09-11 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    implementing the VLABS portal driven by data.

* Plan 
** [[https://github.com/vlead/vlabs-landing-pages/milestone/4][Milestone two]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 
  Once this milestone is realized, the following are
  completed in the VLABS portal:
  1. Search functionality
  2. Sign n functionality 
  3. Register functionality

  
#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    S. | Tasks               | Github     |  Expected | Actual |  Estimated |     Actual | Status      | Assignee  |
|    NO |                     | Issues     |    Effort | Effort |     Start, |     Start/ |             |           |
|       |                     |            |       (in |    (in |        End |        End |             |           |
|       |                     |            |    person | person |      Dates |      Dates |             |           |
|       |                     |            |    hours) | hours) |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    1. | Adding key word     | [[https://github.com/vlead/vlabs-landing-pages/issues/86][#86]]        |        48 |        | 27-10-2017 |            | backlog     | Madhavi   |
|       | based search        |            |           |        | 29-10-2017 |            |             |           |
|       | feature             |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    2. | Unable to navigate  | [[https://github.com/vlead/vlabs-landing-pages/issues/85][#85]]        |           |        | 29-10-2017 |            | bug         | Mrudhvika |
|       | institute wise      |            |        32 |        | 30-10-2017 |            |             | Balamma   |
|       | labs from           |            |           |        |            |            |             | Madhavi   |
|       | experiment page     |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    3. | Header and footer   | [[https://github.com/vlead/vlabs-landing-pages/issues/84][#84]]        |        16 |     16 | 16-10-2017 | 16-10-2017 | bug         | Balamma   |
|       | not visible in      |            |           |        | 18-10-2017 | 18-10-2017 | Done        | Mrudhvika |
|       | open-edx labs       |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    4. | Add a Favicon to    | [[https://github.com/vlead/vlabs-landing-pages/issues/83][#83]]        |        03 |     01 | 19-10-2017 | 19-10-2017 | Done        | Balamma   |
|       | vlabs landing page  |            |           |        | 19-10-2017 | 19-10-2017 |             | Mrudhvika |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    5. | Setting of search   | [[https://github.com/vlead/vlabs-landing-pages/issues/82][#82]]        |        06 |     06 | 09-10-2017 | 10-10-2017 | Done        | Balamma   |
|       | icon width and      |            |           |        | 09-10-2017 | 10-10-2017 |             |           |
|       | height              |            |           |        |            |            |             | Mrudhvika |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    6. | Fix Grid layout     | [[https://github.com/vlead/vlabs-landing-pages/issues/81][#81]]        |        16 |        | 12-10-2017 |            | bug         | Balamma   |
|       | styles              |            |           |        | 14-10-2017 |            | In progress | Mrudhvika |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    7. | Header is repeating | [[https://github.com/vlead/vlabs-landing-pages/issues/80][#80]]        |        32 |     14 | 13-10-2017 | 24-10-2017 | Done        | Mrudhvika |
|       | twice when broswer  |            |           |        | 14-10-2017 | 24-10-2017 |             | Balamma   |
|       | 'back' button was   |            |           |        |            |            |             |           |
|       | clicked             |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    8. | Micro biology I     | [[https://github.com/vlead/vlabs-landing-pages/issues/90][#90]]        |        03 |     03 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | and Molecular       |            |           |        | 10-10-2017 | 10-10-2017 |             |           |
|       | fluorescence        |            |           |        |            |            |             |           |
|       | spectroscopy        |            |           |        |            |            |             |           |
|       | have same images    |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    9. | Verifying the list  | [[https://github.com/vlead/vlabs-landing-pages/issues/91][#91]]        |        03 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | of captured labs.   |            |           |        | 10-10-2017 | 10-10-2017 |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   10. | Remove hyperlink of | [[https://github.com/vlead/vlabs-landing-pages/issues/92][#92]]        |        04 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | disciplines titles  |            |           |        | 10-10-2017 | 10-10-2017 |             | Balamma   |
|       | on all disciplines  |            |           |        |            |            |             |           |
|       | page.               |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   11. | Remove hyperlink of | [[https://github.com/vlead/vlabs-landing-pages/issues/93][#93]]        |        04 |     04 | 11-10-2017 | 11-10-2017 | Done        | Mrudhvika |
|       | institutes titles   |            |           |        | 11-10-2017 | 11-10-2017 |             | Balamma   |
|       | on all institutes   |            |           |        |            |            |             |           |
|       | page.               |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   12. | Align institutes    | [[https://github.com/vlead/vlabs-landing-pages/issues/94][#94]]        |        06 |     04 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|       | titles along with   |            |           |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|       | institute logos     |            |           |        |            |            |             |           |
|       | on all institutes.  |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   13. | Align disciplines   | [[https://github.com/vlead/vlabs-landing-pages/issues/95][#95]]        |        06 |     06 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|       | titles along with   |            |           |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|       | disciplines logos   |            |           |        |            |            |             |           |
|       | on all disciplines  |            |           |        |            |            |             |           |
|       | page.               |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   14. | Align lab titles    | [[https://github.com/vlead/vlabs-landing-pages/issues/96][#96]]        |        08 |     08 | 12-10-2017 |            | Done        | Balamma   |
|       | along with labs     |            |           |        | 12-10-2017 |            |             | Mrudhvika |
|       | images on all labs  |            |           |        |            |            |             |           |
|       | page                |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   15. | Changing the lab    | [[https://github.com/vlead/vlabs-landing-pages/issues/98][#98]]        |        04 |     04 | 14-10-2017 | 14-10-2017 | Done        | Mrudhvika |
|       | names in Title      |            |           |        | 14-10-2017 | 14-10-2017 |             | Sanchita  |
|       | case from lower     |            |           |        |            |            |             |           |
|       | case type           |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   16. | Change lab names    | [[https://github.com/vlead/vlabs-landing-pages/issues/99][#99]]        |        08 |     08 | 21-10-2017 | 21-10-2017 | Done        | Balamma   |
|       | styles and images   |            |           |        | 21-10-2017 | 21-10-2017 |             | Mrudhvika |
|       | properties as per   |            |           |        |            |            |             |           |
|       | open edx labs       |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   17. | Change lab names    | [[https://github.com/vlead/vlabs-landing-pages/issues/100][#100]]       |        16 |     16 | 22-10-2017 | 22-10-2017 | Done        | Balamma   |
|       | styles and images   |            |           |        | 22-10-2017 | 22-10-2017 |             | Sanchita  |
|       | properties as per   |            |           |        |            |            |             |           |
|       | open edx labs       |            |           |        |            |            |             |           |
|       | layout on           |            |           |        |            |            |             |           |
|       | individual          |            |           |        |            |            |             |           |
|       | institutes and      |            |           |        |            |            |             |           |
|       | Disciplines         |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   18. | Change lab names    | [[https://github.com/vlead/vlabs-landing-pages/issues/101][#101]]       |        08 |     08 | 13-10-2017 | 13-10-2017 | Done        | Mrudhvika |
|       | styles and images   |            |           |        | 13-10-2017 | 13-10-2017 |             | Sanchita  |
|       | properties as per   |            |           |        |            |            |             |           |
|       | open edx labs       |            |           |        |            |            |             |           |
|       | layout on keyword   |            |           |        |            |            |             |           |
|       | search page         |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   19. | Banner image on     | [[https://github.com/vlead/vlabs-landing-pages/issues/103][#103]]       |        12 |     12 | 12-10-2017 | 12-10-2017 | Done        | Mrudhvika |
|       | vlabs landing pages |            |           |        | 12-10-2017 | 12-10-2017 |             | Sanchita  |
|       |                     |            |           |        |            |            |             | Balamma   |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   20. | Fixing grid styles  | [[https://github.com/vlead/vlabs-landing-pages/issues/105][#105]]       |        16 |        |            |            |             | Balamma   |
|       | while traversing    |            |           |        |            |            |             | Mrudhvika |
|       | through individual  |            |           |        |            |            |             |           |
|       | institutes and      |            |           |        |            |            |             |           |
|       | disciplines         |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   21. | Recollecting 6 labs | [[https://github.com/vlead/vlabs-landing-pages/issues/106][#106]]       |        08 |     08 | 17-10-2017 | 17-10-2017 | Done        | Mrudhvika |
|       | images to update    |            |           |        | 17-10-2017 | 17-10-2017 |             |           |
|       | on lds              |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   22. | Remove header       | [[https://github.com/vlead/vlabs-landing-pages/issues/108][#108]]  [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]] |        10 |     10 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | iframe and create   | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]  [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]] |           |        | 25-10-2017 | 25-10-2017 |             | Madhavi   |
|       | header division in  | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]  [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]] |           |        |            |            |             | Mrudhvika |
|       | html                |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   23. | Unable to navigate  | [[https://github.com/vlead/vlabs-landing-pages/issues/109][#109]]       |        16 |        | 25-10-2017 | 25-10-2017 | In Progress | Madhavi   |
|       | discipline wise     |            |           |        | 26-10-2017 | 26-10-2017 |             |           |
|       | labs from           |            |           |        |            |            |             |           |
|       | experiment page     |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   24. | Adding header       | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | division to vlabs   |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | landing pages.      |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   25. | Adding banner in a  | [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | division to vlabs   |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | landing pages.      |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   26. | Adding usage        | [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | section             |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   27. | Fixing the height   | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | of the content      |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | iframe.             |            |           |        |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   28. | Adding styles to    | [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | the header division |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
| Total |                     |            |       295 |    146 |            |            |             |           |
|     ^ |                     |            | estimated | actual |            |            |             |           |
|-------+---------------------+------------+-----------+--------+------------+------------+-------------+-----------|
#+TBLFM: $estimated=vsum(@II+1..@-1)
#+TBLFM: $actual=vsum(@II+1..@-1)


** Milestone Three
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    S. | Tasks               | Github | Expected | Actual |  Estimated | Actual | Status  | Assignee  |
|    NO |                     | Issues | Effort   | Effort |     Start, | Start/ |         |           |
|       |                     |        | (in      | (in    |        End | End    |         |           |
|       |                     |        | person   | person |      Dates | Dates  |         |           |
|       |                     |        | hours)   | hours) |            |        |         |           |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    1. | Adding login        | [[https://github.com/vlead/vlabs-landing-pages/issues/89][#89]]    | 20       |        | 13-10-2017 |        | backlog | Madhavi   |
|       | functionality for   |        |          |        | 17-10-2017 |        |         | Balamma   |
|       | vlabs landing page  |        |          |        |            |        |         | Mrudhvika |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    2. | Adding signup       | [[https://github.com/vlead/vlabs-landing-pages/issues/88][#88]]    | 30       |        | 17-10-2017 |        | backlog | Madhavi   |
|       | functionality for   |        |          |        | 23-10-2017 |        |         | Balamma   |
|       | vlabs landing page  |        |          |        |            |        |         | Mrudhvika |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    3. | Enable Sign up      | [[https://github.com/vlead/vlabs-landing-pages/issues/87][#87]]    | 32       |        | 25-10-2017 |        | backlog | Madhavi   |
|       | and Login buttons   |        |          |        | 26-10-2017 |        |         | Mrudhvika |
|       | (includes           |        |          |        |            |        |         | Balamma   |
|       | functionality)      |        |          |        |            |        |         |           |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    4. | Interaction between | [[https://github.com/vlead/vlabs-landing-pages/issues/97][#97]]    |          |        |            |        |         |           |
|       | iframes using       |        |          |        |            |        |         |           |
|       | postmessage         |        |          |        |            |        |         |           |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|    5. | setup machine to    | [[https://github.com/vlead/vlabs-landing-pages/issues/102][#102]]   |          |        |            |        |         |           |
|       | run openedx vagrant |        |          |        |            |        |         |           |
|       | box for dev         |        |          |        |            |        |         |           |
|       | environment         |        |          |        |            |        |         |           |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
|     = |                     |        |          |        |            |        |         |           |
| Total |                     |        | 82       |        |            |        |         |           |
|     ^ |                     |        | total    |        |            |        |         |           |
|-------+---------------------+--------+----------+--------+------------+--------+---------+-----------|
#+TBLFM: $total=vsum(@II+1..@-1

** [[https://github.com/vlead/vlabs-landing-pages/milestone/4][Milestone One]]
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 
  Once this milestone is realized, the following are done to
  the VLABS portal:
  1. All institutes can be populated dynamically.
  2. All Disciplines can be populated dynamically.
  3. All labs can be populated dynamically on clicking on
     each institute.
  4. All labs can be populated dynamically clicking on each
     discipline.
  5. All labs can be populated dynamically.
  6. Styles can be applied dynamically.
  7. Footer service can be integrated as a service.
 

#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    S. | Tasks                | Github | Expected | Actual |     Actual |  Estimated | Status   | Assignee   |
|    NO |                      | Issues |   Effort | Effort |     Start, |     Start/ |          |            |
|       |                      |        |      (in |    (in |        End |        End |          |            |
|       |                      |        |   person | person |      Dates |      Dates |          |            |
|       |                      |        |   hours) | hours) |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    1. | Ability to           | [[https://github.com/vlead/vlabs-landing-pages/issues/2][#2]]     |       42 |     30 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|       | display the          |        |          |        | 07-09-2017 | 09-09-2017 |          | Mrudhvika  |
|       | labs                 |        |          |        |            |            |          |            |
|       | developed            |        |          |        |            |            |          |            |
|       | by Partner           |        |          |        |            |            |          |            |
|       | Institutes           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    2. | Dynamic footer       | [[https://github.com/vlead/vlabs-landing-pages/issues/21][#21]]    |       24 |     32 | 29-08-2017 | 29-08-2017 | Done     | Sanchita   |
|       | service need to      |        |          |        | 05-09-2017 | 31-08-2017 |          |            |
|       | be integrated        |        |          |        |            |            |          |            |
|       | into an iframe       |        |          |        |            |            |          |            |
|       | of landing page      |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    3. | Update the hosted    | [[https://github.com/vlead/vlabs-landing-pages/issues/25][#25]]    |        8 |      8 | 07-09-2017 | 07-09-2017 | Done     | Sanchita   |
|       | URLs of labs in LDS  |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|       | with openedx URLs    |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    4. | collect thumbnail    | [[https://github.com/vlead/vlabs-landing-pages/issues/24][#24]]    |       24 |     24 | 31-08-2017 | 31-08-2017 | Done     | Balamma    |
|       | for all the          |        |          |        | 03-09-2017 | 03-09-2017 |          |            |
|       | labs                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    5. | All labs are loading | [[https://github.com/vlead/vlabs-landing-pages/issues/71][#71]]    |          |        |            |            | backlog  | Madhvi     |
|       | 3 labs in a row      |        |          |        |            |            |          | Mrudhvika  |
|       | instead it should    |        |        8 |      8 | 31-08-2017 | 31-08-2017 | Done     | Sanchita   |
|       | load 4 labs          |        |          |        |            |            |          | Balamma    |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    6. | Labs hosted on       | [[https://github.com/vlead/vlabs-landing-pages/issues/30][#30]]    |        8 |    0.5 | 11-09-2017 | 11-09-2017 | Done     | Madhavi    |
|       | 'open-edx' are       |        |          |        | 11-09-2017 | 11-09-2017 |          |            |
|       | not loading          |        |          |        |            |            |          |            |
|       | in an iframe         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    7. | current theming      | [[https://github.com/vlead/vlabs-landing-pages/issues/31][#31]]    |          |        |            |            | Done     | Shiva      |
|       | for open-edx         |        |          |        |            |            |          | Raghupathi |
|       | labs has to          |        |          |        |            |            |          |            |
|       | be removed           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    8. | create test          | [[https://github.com/vlead/vlabs-landing-pages/issues/32][#32]]    |          |        |            |            | Done     | Shiva      |
|       | open-edx instance    |        |          |        |            |            |          | Raghupathi |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    9. | Deploy all the       | [[https://github.com/vlead/vlabs-landing-pages/issues/33][#33]]    |          |        |            |            |          | Shiva      |
|       | labs on test         |        |          |        |            |            | Done     | Raghupathi |
|       | open-edx instance    |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   10. | Remove theming       | [[https://github.com/vlead/vlabs-landing-pages/issues/34][#34]]    |        8 |        |            |            | Done     | Shiva      |
|       | from test            |        |          |        |            |            |          | Raghupathi |
|       | instance of          |        |          |        |            |            |          |            |
|       | open-edx             |        |          |        |            |            |          |            |
|       | 'hosting_info'       |        |          |        | 14-09-2017 | 14-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   11. | Add a new row to     | [[https://github.com/vlead/vlabs-landing-pages/issues/35][#35]]    |        8 |        | 14-09-2017 | 14-09-2017 | Done     | Mrudhvika  |
|       | of 'lab' table       |        |          |        |            |            |          |            |
|       | and update           |        |          |        |            |            |          |            |
|       | 'hosted_on' to       |        |          |        |            |            |          |            |
|       | 'test-openedx'       |        |          |        |            |            |          |            |
|       | and also             |        |          |        |            |            |          |            |
|       | update               |        |          |        |            |            |          |            |
|       | 'hosted_url'         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   12. | Update config in     | [[https://github.com/vlead/vlabs-landing-pages/issues/36][#36]]    |       12 |      9 | 14-09-2017 | 14-09-2017 | Done     | Madhavi    |
|       | the vlabs landing    |        |          |        | 15-09-2017 | 15-09-2017 |          |            |
|       | pages to read        |        |          |        |            |            |          |            |
|       | either the           |        |          |        |            |            |          |            |
|       | hosted url of        |        |          |        |            |            |          |            |
|       | production or        |        |          |        |            |            |          |            |
|       | test instance of     |        |          |        |            |            |          |            |
|       | openedx              |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   13. | Some labs are        | [[https://github.com/vlead/vlabs-landing-pages/issues/37][#37]]    |       16 |        | 09-09-2017 | 09-09-2017 | In       | Sanchita   |
|       | not captured in      |        |          |        | 11-09-2017 |            | Progress |            |
|       | lds database         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   14. | Styling for          |        |          |        |            |            | In       | Balamma    |
|       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/29][#29]]    |          |        |            |            | progress |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   15. | Populate 'Asset      |        |       12 |      8 | 09-09-2017 | 09-09-2017 | Done     | Mrudhvika  |
|       | Urls' for all        | [[https://github.com/vlead/vlabs-landing-pages/issues/28][#28]]    |          |        | 09-09-2017 | 09-09-2017 |          |            |
|       | the Labs in LDS.     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   16. | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/3][#3]]     |       18 |     24 | 30-08-2017 | 30-08-2017 | Done     | Madhavi    |
|       | all Discipline and   |        |          |        | 05-09-2017 | 04-09-2017 |          |            |
|       | Domain wise labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   17. | Header Styling for   | [[https://github.com/vlead/vlabs-landing-pages/issues/41][#41]]    |       40 |     40 | 04-09-2017 | 04-09-2017 | Done     | Balamma    |
|       | Vlabs landing page   |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   18. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/43][#43]]    |       40 |     36 | 11-09-2017 | 11-09-2017 | Done     | Balamma    |
|       | for Institutes       |        |          |        | 13-09-2017 | 15-09-2017 |          | Madhavi    |
|       | images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   19. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/44][#44]]    |       40 |     36 | 13-09-2017 | 13-09-2017 | Done     | Balamma    |
|       | for Disciplines      |        |          |        | 15-09-2017 | 15-09-2017 |          | Madhavi    |
|       | images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   20. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/45][#45]]    |       40 |     36 | 15-09-2017 | 13-09-2017 | Done     | Balamma    |
|       | for All Labs images  |        |          |        | 19-09-2017 | 15-09-2017 |          | Madhavi    |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   21. | Requirements for     | [[https://github.com/vlead/vlabs-landing-pages/issues/10][#10]]    |        6 |      2 | 30-09-2017 | 30-09-2017 | Done     | Thirumal   |
|       | Vlabs Landing Pages  |        |          |        | 30-09-2017 | 30-09-2017 |          | Madhavi    |
|       |                      |        |          |        |            |            |          | Balamma    |
|       |                      |        |          |        |            |            |          | Mrudhvika  |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   22. | Design for           | [[https://github.com/vlead/vlabs-landing-pages/issues/9][#9]]     |        2 |    0.5 | 13-09-2017 | 13-09-2017 | Done     | Mrudhvika  |
|       | Vlabs Landing Page   |        |          |        | 13-09-2017 | 13-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   23. | Setting up           | [[https://github.com/vlead/vlabs-landing-pages/issues/27][#27]]    |      0.5 |    0.5 | 08-09-2017 | 08-09-2017 | Done     | Madhavi    |
|       | Incremental build    |        |          |        | 08-09-2017 | 08-09-2017 |          | Mrudhvika  |
|       | in local machine     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   24. | Set up               | [[https://github.com/vlead/vlabs-landing-pages/issues/18][#18]]    |        1 |      1 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|       | lab data service     |        |          |        | 31-08-2017 | 31-08-2017 |          | Mrudhvika  |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   25. | change 'institute'   | [[https://github.com/vlead/vlabs-landing-pages/issues/51][#51]]    |          |        |            |            |          |            |
|       | tab in the header    |        |          |        |            |            |          |            |
|       | to drop down menu    |        |          |        |            |            |          |            |
|       | to display all       |        |          |        |            |            |          |            |
|       | institutes           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   26. | change 'discipline'  | [[https://github.com/vlead/vlabs-landing-pages/issues/52][#52]]    |          |        |            |            |          |            |
|       | tab in the header    |        |          |        |            |            |          |            |
|       | to drop down menu    |        |          |        |            |            |          |            |
|       | to display all       |        |          |        |            |            |          |            |
|       | disciplines          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   27. | check the images     | [[https://github.com/vlead/vlabs-landing-pages/issues/54][#54]]    |          |        |            |            |          |            |
|       | for all the labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   28. | Syntax error in      | [[https://github.com/vlead/vlabs-landing-pages/issues/55][#55]]    |          |        |            |            |          |            |
|       | footer               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   29. | Reference Error:     | [[https://github.com/vlead/vlabs-landing-pages/issues/56][#56]]    |          |        |            |            |          |            |
|       | $ is not defined     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   30. | Collect Discipline   | [[https://github.com/vlead/vlabs-landing-pages/issues/22][#22]]    |          |        |            |            |          |            |
|       | and institute images |        |          |        |            |            |          |            |
|       | and update their     |        |          |        |            |            |          |            |
|       | links in lds         |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    31 | Footer edges should  | [[https://github.com/vlead/vlabs-landing-pages/issues/73][#73]]    |          |        |            |            |          |            |
|       | be same as iframe    |        |          |        |            |            |          |            |
|       | edges                |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    32 | Deployment of        |        |          |        |            |            |          |            |
|       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/76][#76]]    |          |        |            |            |          |            |
|       | on testing and       |        |          |        |            |            |          |            |
|       | staging              |        |          |        |            |            |          |            |
|       | environments         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    33 | all fonts should     | [[https://github.com/vlead/vlabs-landing-pages/issues/72][#72]]    |          |        |            |            |          |            |
|       | be consistency       |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    34 | Maintain separate    | [[https://github.com/vlead/vlabs-landing-pages/issues/61][#61]]    |          |        |            |            |          |            |
|       | Javascript files     |        |          |        |            |            |          |            |
|       | for individual       |        |          |        |            |            |          |            |
|       | frames               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    35 | Load 'Usage' and     | [[https://github.com/vlead/vlabs-landing-pages/issues/74][#74]]    |          |        |            |            |          |            |
|       | 'Workshop Usage'     |        |          |        |            |            |          |            |
|       | page in content      |        |          |        |            |            |          |            |
|       | Iframe               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    36 | All labs are         | [[https://github.com/vlead/vlabs-landing-pages/issues/79][#79]]    |          |        |            |            |          |            |
|       | loading 3 labs       |        |          |        |            |            |          |            |
|       | in a row instead     |        |          |        |            |            |          |            |
|       | it should load       |        |          |        |            |            |          |            |
|       | 4 labs.              |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    37 | Collect other        | [[https://github.com/vlead/vlabs-landing-pages/issues/67][#67]]    |          |        |            |            |          |            |
|       | discipline           |        |          |        |            |            |          |            |
|       | icons/images         |        |          |        |            |            |          |            |
|       | and update them      |        |          |        |            |            |          |            |
|       | in the database      |        |          |        |            |            |          |            |
|       | and also in the      |        |          |        |            |            |          |            |
|       | file server          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    38 | Header Iframe is     | [[https://github.com/vlead/vlabs-landing-pages/issues/14][#14]]    |          |        |            |            |          |            |
|       | overlapping with     |        |          |        |            |            |          |            |
|       | content Iframe       |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    39 | Remove extra white   | [[https://github.com/vlead/vlabs-landing-pages/issues/69][#69]]    |          |        |            |            |          |            |
|       | space between items  |        |          |        |            |            |          |            |
|       | in 'Institute' and   |        |          |        |            |            |          |            |
|       | 'Discipline'         |        |          |        |            |            |          |            |
|       | drop down menu       |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    40 | Add banner/slider    | [[https://github.com/vlead/vlabs-landing-pages/issues/64][#64]]    |          |        |            |            |          |            |
|       | on the home page     |        |          |        |            |            |          |            |
|       | of dynamic vlabs     |        |          |        |            |            |          |            |
|       | portal               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    41 | Add 'Analytics'      | [[https://github.com/vlead/vlabs-landing-pages/issues/68][#68]]    |          |        |            |            |          |            |
|       | band below the       |        |          |        |            |            |          |            |
|       | banner to show       |        |          |        |            |            |          |            |
|       | various usage        |        |          |        |            |            |          |            |
|       | counts               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    42 | Onload display       | [[https://github.com/vlead/vlabs-landing-pages/issues/66][#66]]    |          |        |            |            |          |            |
|       | all Disciplines      |        |          |        |            |            |          |            |
|       | on home page         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    43 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/62][#62]]    |          |        |            |            |          |            |
|       | to each institute    |        |          |        |            |            |          |            |
|       | labs selected from   |        |          |        |            |            |          |            |
|       | 'Institute Combo     |        |          |        |            |            |          |            |
|       | box'                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    44 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/63][#63]]    |          |        |            |            |          |            |
|       | to each discipline   |        |          |        |            |            |          |            |
|       | wise labs selected   |        |          |        |            |            |          |            |
|       | from 'Discipline     |        |          |        |            |            |          |            |
|       | Combo box'           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    45 | Add 'Hyperlink'      | [[https://github.com/vlead/vlabs-landing-pages/issues/59][#59]]    |          |        |            |            |          |            |
|       | to lab image         |        |          |        |            |            |          |            |
|       | and lab name         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    46 | Implementation       | [[https://github.com/vlead/vlabs-landing-pages/issues/5][#5]]     |          |        |            |            |          |            |
|       | of Header for        |        |          |        |            |            |          |            |
|       | vlabs landing        |        |          |        |            |            |          |            |
|       | page                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    47 | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/1][#1]]     |          |        |            |            |          |            |
|       | All Labs             |        |          |        |            |            |          |            |
|       | dynamically          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    48 | Apply hidden to      | [[https://github.com/vlead/vlabs-landing-pages/issues/58][#58]]    |          |        |            |            |          |            |
|       | 'Search', 'SignUp'   |        |          |        |            |            |          |            |
|       | and 'Login' buttons  |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    49 | Update the Asset     | [[https://github.com/vlead/vlabs-landing-pages/issues/53][#53]]    |          |        |            |            |          |            |
|       | urls images of       |        |          |        |            |            |          |            |
|       | non-openedx labs     |        |          |        |            |            |          |            |
|       | in lds database      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    50 | Collect Images for   | [[https://github.com/vlead/vlabs-landing-pages/issues/47][#47]]    |          |        |            |            |          |            |
|       | non-openedx labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    51 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/48][#48]]    |          |        |            |            |          |            |
|       | of All labs Images   |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    52 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/49][#49]]    |          |        |            |            |          |            |
|       | of All Institutes    |        |          |        |            |            |          |            |
|       | Images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    53 | Footer Service       | [[https://github.com/vlead/vlabs-landing-pages/issues/13][#13]]    |          |        |            |            |          |            |
|       | Integration          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    54 | design of the        | [[https://github.com/vlead/vlabs-landing-pages/issues/20][#20]]    |          |        |            |            |          |            |
|       | VLABS portal         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
| Total |                      |        |    357.5 |        |            |            |          |            |
|     ^ |                      |        |    total |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
#+TBLFM: $total=vsum(@II+1..@-1)

